/*********************
mbed研修課題1-1
**********************/

/*********************
編集履歴
daichi ofuchi 2022/2/26
**********************/
/**********************************************************************
Include Libraries
**********************************************************************/
#include "mbed.h"//mbedを使うときに絶対includeするやつ
/**********************************************************************
Declare MACRO
**********************************************************************/
#define CTRL_PERIOD 0.02f//制御周期を定義（宣言）する
/**********************************************************************
Proto_type_Declare functions
**********************************************************************/
/**********************************************************************
Declare variables
**********************************************************************/
Timer ControlTicker;//タイマーの宣言
bool ledOutput = 0;//0:LED OFF,1:LED ON
int swPrevStatus = 0;//直前のスイッチの状態
/**********************************************************************
Declare Instances
**********************************************************************/
DigitalIn SW(A1);//スイッチの宣言
DigitalOut led1(LED1);//LEDの宣言
/**********************************************************************
Main
**********************************************************************/

int main()
{
    ControlTicker.start();//タイマースタート
    while(1)//while(1)とすることで無限にループする
    {
      if (ControlTicker.read() >= CTRL_PERIOD)//ControlTicker.read()でタイマーの値を読みその値がCTRL_PERIOD以上になったときにif文の中に入る。つまりCTRL_PERIOD(0.02秒)立たないとif文の中に入らない
      {
        ControlTicker.reset();//タイマーを0からスタート
        if ((SW.read() == 0)&&(swPrevStatus == 1)){
            ledOutput = !ledOutput;//boolの書き方ledOutputの値を反転させる,0だったら1、1だったら0みたいな感じに変える
        }
        /*
        SW.read()で今のスイッチの状態を見ている0:押された1:押されてない
        swPrevStatusで直前のスイッチの状態を見ている。これがないと例えば
        if(SW.read())のみだけだとスイッチが押されている間ずっとif文の中が実行され0と1が高速で切り替わってします
        そこでswPrevStatusを入れることでスイッチを押した瞬間のみだけif文を実行している
        */
        swPrevStatus = SW.read();//一つ前のスイッチの状態を記憶
        led1 = ledOutput;        //led1に出力の値を入れている,0:LED OFF,1:LED ON
      }
    }
}

/*****************************************************************
Functions
*****************************************************************/